livekit/client-sdk-esp32/components/livekit/examples/custom_hardware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# --- Credentials ---
# See README.md for setup instructions.
# CONFIG_LK_EXAMPLE_USE_SANDBOX=y
# CONFIG_LK_EXAMPLE_SANDBOX_ID="my-project-xxxxxx"
CONFIG_LK_EXAMPLE_USE_PREGENERATED=y
CONFIG_LK_EXAMPLE_SERVER_URL="ws://localhost:7880"
# CONFIG_LK_EXAMPLE_TOKEN="your-jwt-token"

# --- Waveshare ESP32-S3-Touch-LCD-1.83 board settings ---
CONFIG_LK_EXAMPLE_SPEAKER_VOLUME=85

# --- Performance ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# --- PSRAM (8 MB octal) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Flash (16 MB QIO) ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- Cache ---
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# --- TLS / WebRTC ---
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y

# --- WebSocket ---
CONFIG_ESP_WS_CLIENT_ENABLE_DYNAMIC_BUFFER=y
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y

# --- SNTP ---
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- Partition table ---
CONFIG_PARTITION_TABLE_CUSTOM=y

# --- Experimental features (required by some components) ---
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
